package com.app.deliveryapplication


val PRODUCTS_CATEGORIES: List<Pair<Int, String>> =
    listOf(
            Pair(R.drawable.ic_soft_drink, "Напитки"),
            Pair(R.drawable.ic_milk, "Молочное"),
            Pair(R.drawable.ic_bread, "Хлеб и выпечка"),
            Pair(R.drawable.ic_meat, "Мясо"),
            Pair(R.drawable.ic_fish, "Морепродукты"),
            Pair(R.drawable.ic_cheese, "Сыр, масло"),
            Pair(R.drawable.ic_vegetable, "Овощи, фрукты"),
            Pair(R.drawable.ic_grocery, "Бакалея"),
            Pair(R.drawable.ic_tea, "Чай и кофе"),
            Pair(R.drawable.ic_cake, "Кондитерское"),
            Pair(R.drawable.ic_canned_food, "Консервы"),
            Pair(R.drawable.ic_icecream, "Мороженое"),
            Pair(R.drawable.ic_salt, "Соль, специи"),
            Pair(R.drawable.ic_souce, "Соусы"),
            Pair(R.drawable.ic_asian_food, "Азиатская еда"),
            Pair(R.drawable.ic_fridge, "Замороженное"),
            Pair(R.drawable.ic_water, "Вода для кулера"),
            Pair(R.drawable.ic_zoo_goods, "Зоотовары"),
            Pair(R.drawable.ic_cosmetics, "Косметика"),
            Pair(R.drawable.ic_toothpaste, "Гигиена"),
            Pair(R.drawable.ic_children_goods, "Для детей"),
            Pair(R.drawable.ic_clean, "Уборка"),
            Pair(R.drawable.ic_washing_machine, "Стирка")
            )

val PRODUCTS_SUBCATEGORIES: Map<String, List<String>> = mapOf(
        "Напитки" to listOf(
                "Квас",
                "Чай холодный",
                "Соки, нектары",
                "Энергетические напитки",
                "Вода питьевая и минеральная",
                "Газированные напитки, лимонады"
        ),
        "Молочное" to listOf(

                "Молоко",
                "Сливки",
                "Йогурты",
                "Сметана",
                "Творог",
                "Кефир",
                "Сгущенное молоко",
                "Десерты, творожки",
                "Кисломолочные напитки",
                "Молочные коктейли и напитки",
                "Сырки глазированные, творожная масса"

        ),
        "Хлеб и выпечка" to listOf(

                "Хлебцы",
                "Булочки, сдоба",
                "Хлеб, лаваш, лепёшки",
                "Баранки, сушки, сухари",
                "Хлебные палочки, тарталетки",
                "Замороженное тесто и выпечка"

        ),
        "Мясо" to listOf(

                "Фарш",
                "Свинина",
                "Ветчина",
                "Говядина",
                "Птица",
                "Кролик",
                "Паштеты",
                "Шашлык",
                "Шпик, сало",
                "Колбасы, рулеты",
                "Сосиски и сардельки"

        ),
        "Морепродукты" to listOf(

                "Рыба",
                "Икра",
                "Морепродукты",
                "Сушеная рыба, морепродукты"

        ),
        "Сыр, масло" to listOf(

                "Яйца",
                "Сыр",
                "Сливочное масло, маргарины, спреды"

        ),
        "Овощи, фрукты" to listOf(

                "Лук",
                "Перец",
                "Зелень",
                "Грибы",
                "Огурец",
                "Свекла",
                "Морковь",
                "Салаты",
                "Капуста",
                "Сельдерей",
                "Картофель",
                "Томат, помидоры",
                "Редька, редис, репа",
                "Чеснок, хрен, имбирь",
                "Кукуруза, бобы, фасоль",
                "Кабачок, баклажан, тыква"

        ),
        "Бакалея" to listOf(

                "Каши",
                "Крупы",
                "Семечки",
                "Сухофрукты, орехи",
                "Растительные масла",
                "Макаронные изделия",
                "Жевательная резинка",
                "Продукты без глютена",
                "Мука, дрожжи, добавки",
                "Соль, сахар, заменители",
                "Соль, сахар, заменители",
                "Мёд, варенье, джемы, сиропы",
                "Хлопья, мюсли, сухие завтраки",
                "Сухарики, чипсы, снеки, попкорн"

        ),
        "Чай и кофе" to listOf(

                "Какао",
                "Цикорий",
                "Капсулы",
                "Листовой чай",
                "Зерновой кофе",
                "Горячий шоколад",
                "Пакетированный чай"

        ),
        "Кондитерское" to listOf(

                        "Вафли",
                        "Восточные сладости",
                        "Торты, пироги, пирожные",
                        "Рулеты, круассаны, кексы",
                        "Мармелад, зефир, пастила",
                        "Печенье, крекеры, пряники",
                        "Шоколадные и ореховые пасты"

        ),
        "Консервы" to listOf(

                "Мясные консервы",
                "Рыбные консервы",
                "Оливки, маслины",
                "Грибные консервы",
                "Восточные сладости",
                "Фруктовые консервы",
                "Мармелад, зефир, пастила"

        ),
        "Мороженое" to listOf(

                "Лотки",
                "Эскимо",
                "Брикет",
                "Фруктовый лёд",
                "Рулеты, торты",
                "Семейная упаковка",
                "Расходники для мороженого"

        ),
        "Соль, специи" to listOf(

                "Специи, приправы, пряности"

        ),
        "Соусы" to listOf(

                "Майонез",
                "Соусы и кетчуп",
                "Томатные пасты",
                "Маринады и уксус",
                "Аджика, горчица, хрен"

        ),
        "Азиатская еда" to listOf(

                "Водоросли",
                "Семя кунжутное",
                "Палочки для суши",
                "Бумага для роллов",
                "Соусы для восточной кухни",
                "Циновки для приготовления роллов",
                "Рис для суши и роллов, cемя кунжутное"

        ),
        "Замороженное" to listOf(

                "Ягоды и фрукты",
                "Овощи, смеси, грибы",
                "Готовые блюда, салаты",
                "Наггетсы, пицца, чебупели",
                "Блинчики, выпечка, десерты",
                "Пельмени, вареники, хинкали",
                "Котлеты, фрикадельки, колбаски",
                "Продукты быстрого приготовления"

        ),
        "Вода для кулера" to listOf(

                "Вода 19л"

        ),
        "Зоотовары" to listOf(

                "Кошкам",
                "Собакам",
                "Грызунам",
                "Косметика для животных"

        ),
        "Косметика" to listOf(

                "Аксессуары",
                "Уход за ногтями",
                "Макияж для лица",
                "Уход за волосами",
                "Парфюмерия и ароматы",
                "Товары медицинского назначения"

        ),
        "Гигиена" to listOf(

                "Мыло",
                "Женская гигиена",
                "Туалетная бумага",
                "Уход за кожей лица и тела",
                "Средства для ванны и душа",
                "Контрацепция, тесты, гели",
                "Дезодоранты, антиперспиранты",
                "Дезодоранты, антиперспиранты",
                "Салфетки и бумажные полотенца",
                "Уход за зубами и полостью рта",
                "Средства для бритья и эпиляции"

        ),
        "Для детей" to listOf(

                "Подгузники",
                "Детская косметика и гигиена"

        ),
        "Уборка" to listOf(

                "Средства для чистки труб",
                "Средства для уборки кухни",
                "Средства для мытья посуды",
                "Принадлежности для уборки",
                "Средства для уборки комнат",
                "Освежители воздуха и текстиля",
                "Средства для посудомоечных машин",
                "Универсальные средства для уборки",
                "Средства для мытья стекол и зеркал",
                "Средства для уборки ванной и туалета",
                "Чистящие средства для бытовой техники"
        ),
        "Стирка" to listOf(

                "Стиральный порошок",
                "Кондиционер для белья",
                "Жидкости и гели для стирки",
                "Капсулы и таблетки для стирки",
                "Пятновыводители, отбеливатели",
                "Аксессуары для глаженья и чистки одежды",
                "Принадлежности для стирки и сушки белья"
        )
)